{
    "tasksSuggestion1": [
      ["Task", "1º dia - Criar 10 Flashcards usando o conteúdo das páginas 12 e 17. Pode usar o modelo de Flashcards da última página da apostila ou usar o aplicativo Anki ou algum outro que conheça.", false],
      ["Task", "2º dia - Criar 10 frases com o vocabulário de Revisão da página 19. Use o Gerador de Frases I. Revise os 10 Flashcards.", false],
      ["Task", "3º dia - Use post-its para escrever o nome das coisas na sua casa e cole eles. Por exemplo: escreva \"door\" em um post-it e cole na porta. Revise os 10 Flashcards.", false],
      ["Task", "4º dia - Grave você lendo o texto da página 18 pelo menos 3 vezes. Varie o ritmo da leitura e tente ao máximo ler com empolgação. Depois disso crie 10 Flashcards com base no texto. Revise os 10 Flashcards.", false],
      ["Task", "5º dia - Use a gravação do texto que você fez para reescrever ele sem consultar. Revise os 10 Flashcards do primeiro dia e do texto.", false],
      ["Task", "6º dia - Assista ao Vídeo - 01 e pratique as falas do texto. Utilize a técnica do Shadowing.", false]
    ],
    "tasksSuggestion2": [
      ["Task", "1º dia - Criar 10 Flashcards usando o conteúdo da página 61. Pode usar o modelo de Flashcards da última página da apostila ou usar o aplicativo Anki ou algum outro que conheça.", false],
      ["Task", "2º dia - Criar 10 frases com o vocabulário do vídeo que está nas páginas 62 a 64. Use o Gerador de Frases I. Revise os 10 Flashcards.", false],
      ["Task", "3º dia - Durante o dia anote palavras aleatórias que tentou falar em inglês e não soube (tomada, estante, pneu). Depois faça post its e coloque em um lugar que frequenta muito (sua geladeira por exemplo). Revise os 10 Flashcards.", false],
      ["Task", "4º dia - Grave você lendo os textos da página 57 pelo menos 3 vezes. Varie o ritmo da leitura e tente ao máximo ler com empolgação. Escolha 3 frases de cada texto e pratique fazer variações (troque palavras do singular para o plural, troque o tempo, troque o gênero e etc).", false],
      ["Task", "5º dia - Use a gravação do texto que você fez para reescrever ele sem consultar. Escolha apenas um dos textos. Revise os 10 Flashcards do primeiro dia e do texto.", false],
      ["Task", "6º dia - Assista ao Vídeo - 02 e pratique as falas do texto. Utilize a técnica do Shadowing.", false]
    ],
    "tasksSuggestion3": [
      ["Task", "1º dia - Criar 15 Flashcards usando o conteúdo da página 73. Pode usar o modelo de Flashcards da última página da apostila ou usar o aplicativo Anki ou algum outro que conheça.", false],
      ["Task", "2º dia - Criar 10 frases com o vocabulário de Revisão da página 19. Use o Gerador de Frases II. Revise os 10 Flashcards.", false],
      ["Task", "3º dia - Escreva um texto curto sobre como foi seu dia e seus planos para o dia seguinte. Revise os 10 Flashcards.", false],
      ["Task", "4º dia - Grave um áudio tentando responder às seguintes perguntas: What is your name? Where do you live? How old are you? Do you have brothers or sisters? Do you have pets? Revise os 10 Flashcards.", false],
      ["Task", "5º dia - Use a gravação que você fez e escreva as frases. Revise os 10 Flashcards do primeiro dia e do texto.", false],
      ["Task", "6º dia - Assista ao Vídeo - 03 e pratique as falas do texto. Utilize a técnica do Shadowing.", false]
    ],
    "tasksSuggestion4": [
      ["Task", "1º dia - Pratique a leitura do Chapter 1 e 2.", false],
      ["Task", "2º dia - Criar 10 frases com o vocabulário de Revisão da página 19. Use o Gerador de Frases III. Revise os 10 Flashcards.", false],
      ["Task", "3º dia - Pratique a leitura do Chapter 3 e 4.", false],
      ["Task", "4º dia - Grave você lendo os textos 1,2 e 3 pelo menos 3 vezes. Varie o ritmo da leitura e tente ao máximo ler com empolgação. Depois disso crie 10 Flashcards com base no texto. Revise os 10 Flashcards.", false],
      ["Task", "5º dia - Pratique a leitura do Chapter 5 e 6.", false],
      ["Task", "6º dia - Assista ao Vídeo - 04 e pratique as falas do texto. Utilize a técnica do Shadowing.", false]
    ],
    "tasksSuggestion5": [
      ["Task", "1º dia - Criar 10 Flashcards usando o conteúdo das páginas 101 e 102. Pode usar o modelo de Flashcards da última página da apostila ou usar o aplicativo Anki ou algum outro que conheça.", false],
      ["Task", "2º dia - Criar 20 frases com o vocabulário de Revisão da página 19. Use o Gerador de Frases IV. Revise os 10 Flashcards.", false],
      ["Task", "3º dia - Use post-its para escrever as palavras que não entendeu do texto da página 106. Cole em um lugar bastante visível. Revise os 10 Flashcards.", false],
      ["Task", "4º dia - Grave você lendo o texto da página 106 pelo menos 3 vezes. Varie o ritmo da leitura e tente ao máximo ler com empolgação. Depois disso crie 10 Flashcards com base no texto. Revise os 10 Flashcards.", false],
      ["Task", "5º dia - Use a gravação do texto que você fez para reescrever ele sem consultar. Revise os 10 Flashcards do primeiro dia e do texto.", false],
      ["Task", "6º dia - Assista ao Vídeo - 05 e pratique as falas do texto. Utilize a técnica do Shadowing.", false]
    ]
  }
  